## Staging: performance-test
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 6 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                    NAME                                     |
|----------|-----------------------------------------------------------------------------|
| update   | `aws_cloudwatch_event_rule.event_rule`                                      |
|          | `aws_cloudwatch_event_target.ecs_scheduled_task`                            |
|          | `aws_ecs_cluster.perf_test`                                                 |
|          | `aws_iam_role.perf_test_ecs_task`                                           |
|          | `aws_iam_role.scheduled_task_perf_test_event_role`                          |
|          | `aws_iam_role_policy.scheduled_task_perf_test_event_role_cloudwatch_policy` |
| recreate | `aws_ecs_task_definition.perf_test_task`                                    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.scheduled_task_perf_test_event_role_cloudwatch_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "scheduled_task_perf_test_event_role_cloudwatch_policy"  {
      ~ id      = "2115541464" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ecs:RunTask"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecs:ca-central-1:239043911459:task-definition/performance_test_cluster:3"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "iam:PassRole"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::239043911459:role/performance_test_cluster-ecs-task",
                          - "arn:aws:iam::239043911459:role/container_execution_role",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:ecs:ca-central-1:239043911459:task-definition/performance_test_cluster:3",
              ~ (known after apply),
            ]
            # (2 unchanged attributes hidden)
        }
      ~ statement {
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_file.perf_test_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "perf_test_container_definition"  {
      ~ id       = "2436a46f55941f120fdb214bb07c0792555878d823d176e5e1d8d7c0c88949b3" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "PERF_TEST_AWS_S3_BUCKET"
                          - value = "notify-performance-test-results-staging"
                        },
                      - {
                          - name  = "PERF_TEST_CSV_DIRECTORY_PATH"
                          - value = "/tmp/notify_performance_test"
                        },
                      - {
                          - name  = "PERF_TEST_SMS_TEMPLATE_ID"
                          - value = "d5fea9f3-f69d-481e-9186-b7f4eaa5cf63"
                        },
                      - {
                          - name  = "PERF_TEST_BULK_EMAIL_TEMPLATE_ID"
                          - value = "fa759679-30f2-4666-94e2-bd4921329c46"
                        },
                      - {
                          - name  = "PERF_TEST_EMAIL_TEMPLATE_ID"
                          - value = "fa759679-30f2-4666-94e2-bd4921329c46"
                        },
                      - {
                          - name  = "PERF_TEST_EMAIL_WITH_ATTACHMENT_TEMPLATE_ID"
                          - value = "fa759679-30f2-4666-94e2-bd4921329c46"
                        },
                      - {
                          - name  = "PERF_TEST_EMAIL_WITH_LINK_TEMPLATE_ID"
                          - value = "9fb324a5-821d-4b54-9d52-d9ba1fa8373a"
                        },
                    ]
                  - essential        = true
                  - image            = "239043911459.dkr.ecr.ca-central-1.amazonaws.com/notify/performance-test"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "performance_test_cluster"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "performance_test_cluster-task"
                        }
                    }
                  - name             = "performance-tests-container"
                  - secrets          = [
                      - {
                          - name      = "PERF_TEST_PHONE_NUMBER"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_phone_number-DWkOGY"
                        },
                      - {
                          - name      = "PERF_TEST_EMAIL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_email-sWnA9Z"
                        },
                      - {
                          - name      = "PERF_TEST_DOMAIN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_domain-WSUpwW"
                        },
                      - {
                          - name      = "PERF_TEST_AUTH_HEADER"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_auth_header-PxFUOL"
                        },
                    ]
                  - ulimits          = [
                      - {
                          - hardLimit = 98304
                          - name      = "nofile"
                          - softLimit = 98304
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.event_rule will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "event_rule" {
        id                  = "perf_test_event_rule"
        name                = "perf_test_event_rule"
      ~ tags                = {
          - "CostCenter" = "notification-canada-ca-staging" -> null
          + "CostCentre" = "notification-canada-ca-staging"
            # (1 unchanged element hidden)
        }
      ~ tags_all            = {
          - "CostCenter" = "notification-canada-ca-staging" -> null
          + "CostCentre" = "notification-canada-ca-staging"
            # (1 unchanged element hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "perf_test_event_rule-terraform-20211129205416437200000001"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ tags                    = {
              - "CostCenter" = "notification-canada-ca-staging" -> null
              + "CostCentre" = "notification-canada-ca-staging"
            }
          ~ task_definition_arn     = "arn:aws:ecs:ca-central-1:239043911459:task-definition/performance_test_cluster:3" -> (known after apply)
            # (6 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # aws_ecs_cluster.perf_test will be updated in-place
  ~ resource "aws_ecs_cluster" "perf_test" {
        id                 = "arn:aws:ecs:ca-central-1:239043911459:cluster/performance_test_cluster"
        name               = "performance_test_cluster"
      ~ tags               = {
          - "CostCenter" = "notification-canada-ca-staging" -> null
          + "CostCentre" = "notification-canada-ca-staging"
        }
      ~ tags_all           = {
          - "CostCenter" = "notification-canada-ca-staging" -> null
          + "CostCentre" = "notification-canada-ca-staging"
        }
        # (2 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.perf_test_task must be replaced
-/+ resource "aws_ecs_task_definition" "perf_test_task" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:239043911459:task-definition/performance_test_cluster:3" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "PERF_TEST_AWS_S3_BUCKET"
                          - value = "notify-performance-test-results-staging"
                        },
                      - {
                          - name  = "PERF_TEST_BULK_EMAIL_TEMPLATE_ID"
                          - value = "fa759679-30f2-4666-94e2-bd4921329c46"
                        },
                      - {
                          - name  = "PERF_TEST_CSV_DIRECTORY_PATH"
                          - value = "/tmp/notify_performance_test"
                        },
                      - {
                          - name  = "PERF_TEST_EMAIL_TEMPLATE_ID"
                          - value = "fa759679-30f2-4666-94e2-bd4921329c46"
                        },
                      - {
                          - name  = "PERF_TEST_EMAIL_WITH_ATTACHMENT_TEMPLATE_ID"
                          - value = "fa759679-30f2-4666-94e2-bd4921329c46"
                        },
                      - {
                          - name  = "PERF_TEST_EMAIL_WITH_LINK_TEMPLATE_ID"
                          - value = "9fb324a5-821d-4b54-9d52-d9ba1fa8373a"
                        },
                      - {
                          - name  = "PERF_TEST_SMS_TEMPLATE_ID"
                          - value = "d5fea9f3-f69d-481e-9186-b7f4eaa5cf63"
                        },
                    ]
                  - essential        = true
                  - image            = "239043911459.dkr.ecr.ca-central-1.amazonaws.com/notify/performance-test"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "performance_test_cluster"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "performance_test_cluster-task"
                        }
                    }
                  - mountPoints      = []
                  - name             = "performance-tests-container"
                  - portMappings     = []
                  - secrets          = [
                      - {
                          - name      = "PERF_TEST_PHONE_NUMBER"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_phone_number-DWkOGY"
                        },
                      - {
                          - name      = "PERF_TEST_EMAIL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_email-sWnA9Z"
                        },
                      - {
                          - name      = "PERF_TEST_DOMAIN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_domain-WSUpwW"
                        },
                      - {
                          - name      = "PERF_TEST_AUTH_HEADER"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_auth_header-PxFUOL"
                        },
                    ]
                  - ulimits          = [
                      - {
                          - hardLimit = 98304
                          - name      = "nofile"
                          - softLimit = 98304
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "performance_test_cluster" -> (known after apply)
      ~ revision                 = 3 -> (known after apply)
      + skip_destroy             = false
      ~ tags                     = {
          - "CostCenter" = "notification-canada-ca-staging" -> null
          + "CostCentre" = "notification-canada-ca-staging"
        }
      ~ tags_all                 = {
          - "CostCenter" = "notification-canada-ca-staging" -> null
          + "CostCentre" = "notification-canada-ca-staging"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_iam_role.perf_test_ecs_task will be updated in-place
  ~ resource "aws_iam_role" "perf_test_ecs_task" {
        id                    = "performance_test_cluster-ecs-task"
        name                  = "performance_test_cluster-ecs-task"
      ~ tags                  = {
          - "CostCenter" = "notification-canada-ca-staging" -> null
          + "CostCentre" = "notification-canada-ca-staging"
        }
      ~ tags_all              = {
          - "CostCenter" = "notification-canada-ca-staging" -> null
          + "CostCentre" = "notification-canada-ca-staging"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.scheduled_task_perf_test_event_role will be updated in-place
  ~ resource "aws_iam_role" "scheduled_task_perf_test_event_role" {
        id                    = "perf_test_scheduled_task_role"
        name                  = "perf_test_scheduled_task_role"
      ~ tags                  = {
          - "CostCenter" = "notification-canada-ca-staging" -> null
          + "CostCentre" = "notification-canada-ca-staging"
        }
      ~ tags_all              = {
          - "CostCenter" = "notification-canada-ca-staging" -> null
          + "CostCentre" = "notification-canada-ca-staging"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role_policy.scheduled_task_perf_test_event_role_cloudwatch_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "scheduled_task_perf_test_event_role_cloudwatch_policy" {
        id     = "perf_test_scheduled_task_role:performance_test_cluster-ecs-scheduled-policy"
        name   = "performance_test_cluster-ecs-scheduled-policy"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ecs:RunTask"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecs:ca-central-1:239043911459:task-definition/performance_test_cluster:3"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "iam:PassRole"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::239043911459:role/performance_test_cluster-ecs-task",
                          - "arn:aws:iam::239043911459:role/container_execution_role",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 6 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.event_rule"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.perf_test_ecs_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.performance-test"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.perf_test"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.perf_test_task"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.notify_performance_test_s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.perf_test_secretsmanager"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.container_execution_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.perf_test_ecs_task"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.performance-test"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.scheduled_task_perf_test_event_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.perf_test_auth_header"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.perf_test_domain"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.perf_test_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.perf_test_phone_number"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.perf_test"]

33 tests, 17 passed, 16 warnings, 0 failures, 0 exceptions

```

</details>
